---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.MEPAnalyticalConnectionType
source: html/ed0fdca8-b794-d3f8-5fbf-5a042bf9ae07.htm
---
# MEPAnalyticalConnectionType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.